# 1-3 인덱스 활용

## 우선 판다스 import 하고 데이터프레임 만들기

In [1]:
import pandas as pd

In [5]:
data=pd.DataFrame({'이름':['지윤','서준','보검','뷔'],'성별':['여','남','남','남'],'취미':['음악듣기','운동','피아노','농구'],
     '이상형':['계속 바뀜','지윤','지윤','지윤']})

In [8]:
data

   이름 성별    취미    이상형
0  지윤  여  음악듣기  계속 바뀜
1  서준  남    운동     지윤
2  보검  남   피아노     지윤
3   뷔  남    농구     지윤

## set_index 메소드

In [7]:
data.set_index(['이름'])

   성별    취미    이상형
이름
지윤  여  음악듣기  계속 바뀜
서준  남    운동     지윤
보검  남   피아노     지윤
뷔   남    농구     지윤

## reindex 메소드

In [11]:
data.reindex([0,1,2,3,4])

    이름   성별    취미    이상형
0   지윤    여  음악듣기  계속 바뀜
1   서준    남    운동     지윤
2   보검    남   피아노     지윤
3    뷔    남    농구     지윤
4  NaN  NaN   NaN    NaN

In [12]:
data.reindex([0,1,2,3,4],fill_value=0)

   이름 성별    취미    이상형
0  지윤  여  음악듣기  계속 바뀜
1  서준  남    운동     지윤
2  보검  남   피아노     지윤
3   뷔  남    농구     지윤
4   0  0     0      0

## reset_index 메소드

In [14]:
data=data.set_index(['이름'])

In [15]:
data

   성별    취미    이상형
이름
지윤  여  음악듣기  계속 바뀜
서준  남    운동     지윤
보검  남   피아노     지윤
뷔   남    농구     지윤

In [17]:
data=data.reset_index()

In [18]:
data

   이름 성별    취미    이상형
0  지윤  여  음악듣기  계속 바뀜
1  서준  남    운동     지윤
2  보검  남   피아노     지윤
3   뷔  남    농구     지윤

## sort_values 메소드

In [23]:
data['나이']=[25,31,27,24]

In [26]:
data

   이름 성별    취미    이상형  나이
0  지윤  여  음악듣기  계속 바뀜  25
1  서준  남    운동     지윤  31
2  보검  남   피아노     지윤  27
3   뷔  남    농구     지윤  24

In [27]:
data.sort_values(by='나이')

   이름 성별    취미    이상형  나이
3   뷔  남    농구     지윤  24
0  지윤  여  음악듣기  계속 바뀜  25
2  보검  남   피아노     지윤  27
1  서준  남    운동     지윤  31

In [30]:
data.sort_values(by='나이',ascending=False)

   이름 성별    취미    이상형  나이
1  서준  남    운동     지윤  31
2  보검  남   피아노     지윤  27
0  지윤  여  음악듣기  계속 바뀜  25
3   뷔  남    농구     지윤  24

# 1-4 산술연산

## 시리즈 vs 숫자

In [48]:
data2=pd.Series({'16살':155,'18살':159,'20살':160.2})

In [49]:
data2

16살    155.0
18살    159.0
20살    160.2
dtype: float64

### 나의 바람이랄까

In [50]:
data2 + 10

16살    165.0
18살    169.0
20살    170.2
dtype: float64

## 시리즈 vs 시리즈

In [51]:
milk=pd.Series({'16살':15,'18살':10,'20살':5})

In [66]:
milk

16살    15
18살    10
20살     5
dtype: object

In [53]:
data2+milk

16살    170.0
18살    169.0
20살    165.2
dtype: float64

In [69]:
data2['21살']=160.3

In [72]:
data2+milk

16살      170
18살      169
20살    165.2
21살      NaN
dtype: object

In [71]:
data2.add(milk,fill_value=0)

16살      170
18살      169
20살    165.2
21살    160.3
dtype: object

## 데이터프레임 vs 숫자

In [74]:
data['나이']=data['나이']+1

In [75]:
data

   이름 성별    취미    이상형  나이
0  지윤  여  음악듣기  계속 바뀜  26
1  서준  남    운동     지윤  32
2  보검  남   피아노     지윤  28
3   뷔  남    농구     지윤  25

## 데이터프레임 vs 데이터프레임

In [76]:
data3=pd.DataFrame({'국어':[92,88,91,100],'수학':[82,77,68,92],'영어':[71,63,96,70]})
data4=pd.DataFrame({'국어':[91,87,62,66],'수학':[85,72,68,90],'영어':[95,100,100,70]})

In [77]:
data3

    국어  수학  영어
0   92  82  71
1   88  77  63
2   91  68  96
3  100  92  70

In [78]:
data4

   국어  수학   영어
0  91  85   95
1  87  72  100
2  62  68  100
3  66  90   70

In [79]:
(data3+data4)/2

     국어    수학    영어
0  91.5  83.5  83.0
1  87.5  74.5  81.5
2  76.5  68.0  98.0
3  83.0  91.0  70.0